{
  "source": "Cambridge",
  "url": "https://www.collinsdictionary.com/dictionary/english/bolster",
  "word": "bolster",
  "mp3_link": "https://www.collinsdictionary.com/sounds/hwd_sounds/05741.mp3",
  "file": null,
  "definitions": [
    "If you bolster something such as someone's confidence or courage, you increase it.",
    "If someone tries to bolster their position in a situation, they try to strengthen it.",
    "Bolster up means the same as bolster.",
    "A bolster is a firm pillow shaped like a long tube which is sometimes put across a bed under the ordinary pillows.",
    "to support or reinforce; strengthen",
    "to prop up with a pillow or cushion",
    "to add padding to",
    "a long narrow pillow or cushion",
    "any pad or padded support",
    "a short horizontal length of timber fixed to the top of a post to increase the bearing area and reduce the span of the supported beam",
    "a cold chisel having a broad blade splayed towards the cutting edge, used for cutting stone slabs, etc",
    "a long, narrow cushion or pillow",
    "a soft pad for easing pressure on any part of the body",
    "any bolsterlike object or support",
    "a capping piece over a post to extend the bearing area under a beam",
    "the connecting part between the volutes of an Ionic capital",
    "to prop up as with a bolster; support, strengthen, or reinforce",
    "a long, often cylindrical, cushion or pillow for a bed, sofa, etc",
    "anything resembling this in form or in use as a support",
    "any pillow, cushion, or pad",
    "a circular casting on the side of a vessel, through which an anchor chain passes",
    "a timber used as a temporary support",
    "a beam for holding lines or rigging without chafing",
    "a bag filled with buoyant material, fitted into a small boat",
    "an anvil-like support for the lower die of a drop forge",
    "a timber or the like connecting two ribs of a centering",
    "a chisel with a blade splayed toward the edge, used for cutting bricks",
    "a horizontal timber on a post for lessening the free span of a beam",
    "a structural member on which one end of a bridge truss rests",
    "to support with or as with a pillow or cushion",
    "to add to, support, or uphold"
  ]
}