{
  "source": "Cambridge",
  "url": "https://www.collinsdictionary.com/dictionary/english/din",
  "word": "din",
  "mp3_link": "https://www.collinsdictionary.com/sounds/hwd_sounds/15617.mp3",
  "file": null,
  "definitions": [
    "A din is a very loud and unpleasant noise that lasts for some time.",
    "a loud discordant confused noise",
    "to instil (into a person) by constant repetition",
    "to subject to a din",
    "to make a din",
    "a particular religious law; the halacha about something",
    "the ruling of a Beth Din or religious court",
    "religion in general, esp the beliefs and obligations of Islam",
    "a formerly used logarithmic expression of the speed of a photographic film, plate, etc, given as –10 log10E, where E is the exposure of a point 0.1 density units above the fog level; high-speed films have high numbers",
    "a system of standard plugs, sockets, and cables formerly used for interconnecting domestic audio and video equipment",
    "dinar",
    "the standard monetary unit of the following countries or territories. Algeria: divided into 100 centimes. Bahrain: divided into 1000 fils. Iraq: divided into 1000 fils. Jordan: divided into 1000 fils. Kuwait: divided into 1000 fils. Libya: divided into 1000 dirhams. Serbia: divided into 100 paras (formerly the standard monetary unit of Yugoslavia). Sudan, Tunisia: divided into 1000 millimes",
    "a monetary unit of the United Arab Emirates worth one tenth of a dirham",
    "a coin, esp one of gold, formerly used in the Middle East",
    "an association in Germany that sets manufacturing standards, esp. for electronic equipment and photographic film",
    "any of these standards or a set of such standards",
    "of, having to do with, or made according to such a standard or standards",
    "a loud, continuous noise; confused clamor or uproar",
    "to beset with a din",
    "to repeat insistently or noisily",
    "to make a din",
    "a loud, confused noise; a continued loud or tumultuous sound; noisy clamor",
    "to assail with din",
    "to sound or utter with clamor or persistent repetition",
    "to make a din",
    "religion, esp. the religious observances of a Muslim",
    "a designation, originating in Germany, of the speed of a particular film emulsion"
  ]
}