{
  "source": "Cambridge",
  "url": "https://www.collinsdictionary.com/dictionary/english/scuttle",
  "word": "scuttle",
  "mp3_link": "https://www.collinsdictionary.com/sounds/hwd_sounds/48724.mp3",
  "file": null,
  "definitions": [
    "When people or small animals scuttle somewhere, they run there with short quick steps.",
    "To scuttle a plan or a proposal means to make it fail or cause it to stop.",
    "To scuttle a ship means to sink it deliberately by making holes in the bottom.",
    "A scuttle is the same as a coal scuttle.",
    "a shallow basket, esp for carrying vegetables",
    "the part of a motor-car body lying immediately behind the bonnet",
    "to run or move about with short hasty steps",
    "a hurried pace or run",
    "to cause (a vessel) to sink by opening the seacocks or making holes in the bottom",
    "to give up ( hopes, plans, etc)",
    "a small hatch or its cover",
    "to run or move quickly; scurry, esp. away from danger, trouble, etc.",
    "a scurry or scamper; hasty flight",
    "a broad, open basket for carrying grain, vegetables, etc.",
    "a kind of bucket, usually with a wide lip, used for pouring coal on a fire",
    "an opening in a wall or roof, fitted with a lid or cover",
    "a small, covered opening or hatchway in the outer hull or deck of a ship",
    "the lid or cover for any such opening",
    "to make or open holes in the hull of (a ship or boat) below the waterline; esp., to sink in this way",
    "to scrap or abandon (a plan, undertaking, etc.)",
    "a deep bucket for carrying coal",
    "a broad, shallow basket",
    "to run with quick, hasty steps; scurry",
    "a quick pace",
    "a short, hurried run",
    "a small hatch or port in the deck, side, or bottom of a vessel",
    "a cover for this",
    "a small hatchlike opening in a roof or ceiling",
    "to sink (a vessel) deliberately by opening seacocks or making openings in the bottom",
    "to abandon, withdraw from, or cause to be abandoned or destroyed (as plans, hopes, rumors, etc.)",
    "The scuttle is the lower, forward part of a driver's cab or passenger compartment that provides space for the legs of people in the car and separates them from the engine compartment."
  ]
}