{
  "source": "Cambridge",
  "url": "https://www.collinsdictionary.com/dictionary/english/straight",
  "word": "straight",
  "mp3_link": "https://www.collinsdictionary.com/sounds/hwd_sounds/53963.mp3",
  "file": null,
  "definitions": [
    "A straight line or edge continues in the same direction and does not bend or curve.",
    "Straight is also an adverb.",
    "Straight hair has no curls or waves in it.",
    "You use straight to indicate that the way from one place to another is very direct, with no changes of direction.",
    "If you go straight to a place, you go there immediately.",
    "If you give someone a straight answer, you answer them clearly and honestly.",
    "Straight is also an adverb.",
    "Straight means following one after the other, with no gaps or intervals.",
    "Straight is also an adverb.",
    "A straight choice or a straight fight involves only two people or things.",
    "If you describe someone as straight, you mean that they are normal and conventional, for example in their opinions and in the way they live.",
    "If you describe someone as straight, you mean that they are heterosexual.",
    "Straight is also a noun.",
    "A straight drink, especially an alcoholic drink, has not had another liquid such as water added to it.",
    "On a racetrack, a straight is a section of the track that is straight, rather than curved.",
    "not curved or crooked; continuing in the same direction without deviating",
    "straightforward, outright, or candid",
    "even, level, or upright in shape or position",
    "in keeping with the facts; accurate",
    "honest, respectable, or reliable",
    "accurate or logical",
    "continuous; uninterrupted",
    "(esp of an alcoholic drink) undiluted; neat",
    "not crisp, kinked, or curly",
    "correctly arranged; orderly",
    "(of a play, acting style, etc) straightforward or serious",
    "(of a story, article, etc) giving the facts without unnecessary embellishment",
    "sold at a fixed unit price irrespective of the quantity sold",
    "(of a blow) delivered with an unbent arm",
    "(of the cylinders of an internal-combustion engine) in line, rather than in a V-formation or in some other arrangement",
    "no longer owing or being owed something",
    "conventional in views, customs, appearance, etc",
    "not using narcotics; not addicted",
    "in a straight line or direct course",
    "immediately; at once",
    "in an even, level, or upright position",
    "without cheating, lying, or unreliability",
    "continuously; uninterruptedly",
    "without discount regardless of the quantity sold",
    "frankly; candidly",
    "the state of being straight",
    "a straight line, form, part, or position",
    "a straight part of a racetrack",
    "five cards that are in sequence irrespective of suit",
    "a hand containing such a sequence",
    "(as modifier)",
    "a conventional person",
    "a heterosexual person",
    "a cigarette containing only tobacco, without marijuana, etc",
    "having the same direction throughout its length; having no curvature or angularity",
    "not crooked, bent, bowed, wavy, curly, etc.",
    "upright; erect",
    "level; even",
    "with all cylinders in a direct line; in-line: said of some internal-combustion engines",
    "direct; undeviating, uninterrupted, etc.",
    "following strictly the principles, slate of candidates, etc. of a political party",
    "following a direct or systematic course of reasoning, etc.; methodical; accurate",
    "in order; properly arranged, etc.",
    "honest; sincere; upright",
    "reliable; factual",
    "outspoken; frank",
    "without anything added or mixed in; undiluted",
    "not blended with neutral grain spirits",
    "not qualified, modified, slanted, etc.",
    "at a fixed price per unit regardless of the quantity bought or sold",
    "normal or conventional, as in one's lifestyle; also, square (sense 33)",
    "heterosexual",
    "not using drugs, alcohol, etc.",
    "in a straight line or direction; unswervingly",
    "upright; erectly",
    "without detour, delay, etc.",
    "without equivocation, circumlocution, etc.; directly",
    "without alteration, addition, etc.",
    "in an honest, law-abiding manner",
    "the quality or condition of being straight",
    "something straight",
    "the straight part of a racetrack between the last turn and the winning post",
    "a hand consisting of any five cards in sequence: it ranks just above three of a kind and below a flush",
    "a straight, or conventional, person",
    "a heterosexual",
    "without a bend, angle, or curve; not curved; direct",
    "exactly vertical or horizontal; in a perfectly vertical or horizontal plane",
    "generated by a point moving at a constant velocity with respect to another point",
    "evenly or uprightly formed or set",
    "without circumlocution; frank; candid",
    "honest, honorable, or upright, as conduct, dealings, methods, or persons",
    "reliable, as a report or information",
    "right or correct, as reasoning, thinking, or a thinker",
    "in the proper order or condition",
    "continuous or unbroken",
    "thoroughgoing or unreserved",
    "supporting or cast for all candidates of one political party",
    "unmodified or unaltered",
    "without change in the original melody or tempo",
    "heterosexual",
    "traditional; conventional",
    "free from using narcotics",
    "not engaged in crime; law-abiding; reformed",
    "undiluted, as whiskey",
    "straightforward; not striving for effect",
    "written or to be written in a direct and objective manner, with no attempt at individual styling, comment, etc",
    "containing cards in consecutive denominations, as a two, three, four, five, and six, in various suits",
    "in a straight line",
    "in an even form or position",
    "in an erect posture",
    "directly",
    "without circumlocution; frankly; candidly",
    "honestly, honorably, or virtuously",
    "without intricate involvement; not in a roundabout way; to the point",
    "in a steady course",
    "into the proper form or condition; in order",
    "in possession of the truth or of true ideas",
    "sold without discount regardless of the quantity bought",
    "directly and objectively",
    "without personal embellishments, additions, etc",
    "served or drunk without ice, a mixer, or water; neat",
    "the condition of being straight",
    "a straight form or position",
    "a straight line",
    "a straight part, as of a racecourse",
    "a heterosexual",
    "a person who follows traditional or conventional mores",
    "a person who is free from narcotics",
    "a succession of strokes, plays, etc., which gives a perfect score"
  ]
}