{
  "source": "Cambridge",
  "url": "https://www.collinsdictionary.com/dictionary/english/wind-up",
  "word": "wind up",
  "mp3_link": "https://www.collinsdictionary.com/sounds/hwd_sounds/61981.mp3",
  "file": null,
  "definitions": [
    "When you wind up an activity, you finish it or stop doing it.",
    "When someone winds up a business or other organization, they stop running it and close it down completely.",
    "If you wind up in a particular place, situation, or state, you are in it at the end of a series of actions, events, or experiences, even though you did not originally intend to be.",
    "When you wind up something such as the window of a car, you make it move upwards by turning a handle.",
    "If you wind someone up, you deliberately say things which annoy them.",
    "If you wind someone up, you say untrue things in order to trick them.",
    "A wind-up device is a mechanical device with a handle or key that you turn several times before you use it in order to make it work.",
    "A wind-up is a joke or trick in which someone deliberately tells you something untrue in order to annoy you.",
    "to bring to or reach a conclusion",
    "to tighten the spring of (a clockwork mechanism)",
    "to make nervous, tense, etc; excite",
    "to roll ( thread, etc) into a ball",
    "to end up (in a specified state)",
    "to involve; entangle",
    "to hoist or haul up",
    "to tease (someone)",
    "the act of concluding",
    "the finish; end",
    "an act or instance of teasing",
    "having a mechanism powered by the manual tightening of a spring",
    "having a mechanism powered by manual tightening of a spring",
    "an act or instance of teasing",
    "to wind into a ball, etc.",
    "to entangle or involve",
    "to bring or come to an end; conclude",
    "to make very tense, excited, etc.",
    "to use a windup (sense 2) before pitching the ball",
    "to bring to a state of great tension; excite (usually used in the past participle)",
    "to bring or come to an end; conclude",
    "to settle or arrange in order to conclude",
    "to become ultimately",
    "to execute a windup"
  ]
}